PyMOL>load dat/small03.mol2
 ObjectMoleculeReadStr: read through molecule 1.
 ObjectMoleculeReadStr: read through molecule 2.
 ObjectMoleculeReadStr: read through molecule 3.
 ObjectMoleculeReadStr: read through molecule 4.
 ObjectMoleculeReadStr: read through molecule 5.
 ObjectMoleculeReadStr: read through molecule 6.
 ObjectMoleculeReadStr: read through molecule 7.
 ObjectMoleculeReadStr: read through molecule 8.
 ObjectMoleculeReadStr: read through molecule 9.
 ObjectMoleculeReadStr: read through molecule 10.
 ExecutiveLoad: "dat/small03.mol2" loaded as "small03", through state 16.
PyMOL>print cmd.get_names()
['small03']
PyMOL>print cmd.count_states()
16
PyMOL>print cmd.select("(all)")
389
PyMOL>set ray_default_renderer=2
 Setting: ray_default_renderer set to 2.
PyMOL>set valence
 Setting: valence set to on.
PyMOL>frame 1
PyMOL>ray
 RayRenderTest: obtained 19 graphics primitives.
PyMOL>frame 10
PyMOL>ray
 RayRenderTest: obtained 41 graphics primitives.
PyMOL>hide
PyMOL>show sticks
PyMOL>ray
 RayRenderTest: obtained 41 graphics primitives.
PyMOL>unset valence
 Setting: valence set to off.
PyMOL>ray
 RayRenderTest: obtained 37 graphics primitives.
PyMOL>dele all
PyMOL>load dat/small03.mol2, discrete=0
 ObjectMoleculeReadStr: read through molecule 1.
 ObjectMoleculeReadStr: read through molecule 2.
 ObjectMoleculeReadStr: read through molecule 3.
 ObjectMoleculeReadStr: read through molecule 4.
 ObjectMoleculeReadStr: read through molecule 5.
 ObjectMoleculeReadStr: read through molecule 6.
 ObjectMoleculeReadStr: read through molecule 7.
 ObjectMoleculeReadStr: read through molecule 8.
 ObjectMoleculeReadStr: read through molecule 9.
 ObjectMoleculeReadStr: read through molecule 10.
 ExecutiveLoad: "dat/small03.mol2" loaded as "small03", through state 16.
PyMOL>count_atoms
 count_atoms: 369 atoms
PyMOL>dele all
PyMOL>load dat/small03.mol2, multiplex=1
 ExecutiveLoad: loaded 16 objects from "dat/small03.mol2".
PyMOL>print cmd.get_names()
['AGLYSL01', 'AMHTAR01', 'AMPTRB10', 'ARGIND11', 'BAOXLM01', 'BBSPRT10', 'BEVJER10', 'BEWCUB', 'BEWKUJ04', 'BIHKEI01', 'BIPDEJ02', 'BIPJUF10', 'BIPYCL01', 'BITNAT10', 'BIYBIU10', 'BODKOU']
PyMOL>print cmd.count_states()
1
PyMOL>print cmd.select("(all)")
389
PyMOL>dele all
PyMOL>set multiplex, 1
 Setting: multiplex set to 1.
PyMOL>load dat/small03.mol2
 ExecutiveLoad: loaded 16 objects from "dat/small03.mol2".
PyMOL>print cmd.get_names()
['AGLYSL01', 'AMHTAR01', 'AMPTRB10', 'ARGIND11', 'BAOXLM01', 'BBSPRT10', 'BEVJER10', 'BEWCUB', 'BEWKUJ04', 'BIHKEI01', 'BIPDEJ02', 'BIPJUF10', 'BIPYCL01', 'BITNAT10', 'BIYBIU10', 'BODKOU']
PyMOL>print cmd.count_states()
1
PyMOL>print cmd.select("(all)")
389
