PyMOL>scene -10
Error: unknown scene: '-10'. Choices:
PyMOL>scene 9999
Error: unknown scene: '9999'. Choices:
PyMOL>cmd._dump_floats(cmd.get_view(0))
  1.000   0.000   0.000   0.000   1.000   0.000   0.000   0.000   1.000
  0.000   0.000 -50.000   0.000   0.000   0.000  40.000 100.000 -20.000
PyMOL>scene 1,store
 scene: scene stored as "1".
PyMOL>load dat/pept.pdb
 CmdLoad: "dat/pept.pdb" loaded as "pept".
PyMOL>ray
 RayRenderTest: obtained 166 graphics primitives.
PyMOL>cmd._dump_floats(cmd.get_view(0))
  1.000   0.000   0.000   0.000   1.000   0.000   0.000   0.000   1.000
  0.000   0.000 -63.191   1.224 -10.279  20.545  49.820  76.561 -20.000
PyMOL>scene 2,store
 scene: scene stored as "2".
PyMOL>scene 1,recall
 Scene: view updated.
 scene: "1" recalled.
PyMOL>ray
 RayRenderTest: obtained 0 graphics primitives.
PyMOL>scene 2
 Scene: view updated.
 scene: "2" recalled.
PyMOL>ray
 RayRenderTest: obtained 166 graphics primitives.
PyMOL>dist tst,5/ca,8/ca
 Executive: object "tst" created.
PyMOL>turn x,5
PyMOL>cmd._dump_floats(cmd.get_view(0))
  1.000   0.000   0.000   0.000   0.996   0.087   0.000  -0.087   0.996
  0.000   0.000 -63.191   1.224 -10.279  20.545  49.820  76.561 -20.000
PyMOL>scene 3,store
 scene: scene stored as "3".
PyMOL>ray
 RayRenderTest: obtained 180 graphics primitives.
PyMOL>hide dashes,tst
PyMOL>turn y,5
PyMOL>cmd._dump_floats(cmd.get_view(0))
  0.996   0.000  -0.087   0.008   0.996   0.087   0.087  -0.087   0.992
  0.000   0.000 -63.191   1.224 -10.279  20.545  49.820  76.561 -20.000
PyMOL>scene 4,store
 scene: scene stored as "4".
PyMOL>ray
 RayRenderTest: obtained 172 graphics primitives.
PyMOL>scene 3
 Scene: view updated.
 scene: "3" recalled.
PyMOL>disable tst
PyMOL>turn z,20
PyMOL>scene 5,store
 scene: scene stored as "5".
PyMOL>scene 1
 Scene: view updated.
 scene: "1" recalled.
PyMOL>cmd._dump_floats(cmd.get_view(0))
  1.000   0.000   0.000   0.000   1.000   0.000   0.000   0.000   1.000
  0.000   0.000 -50.000   0.000   0.000   0.000  40.000 100.000 -20.000
PyMOL>ray
 RayRenderTest: obtained 0 graphics primitives.
PyMOL>scene 2
 Scene: view updated.
 scene: "2" recalled.
PyMOL>cmd._dump_floats(cmd.get_view(0))
  1.000   0.000   0.000   0.000   1.000   0.000   0.000   0.000   1.000
  0.000   0.000 -63.191   1.224 -10.279  20.545  49.820  76.561 -20.000
PyMOL>ray
 RayRenderTest: obtained 166 graphics primitives.
PyMOL>scene 3
 Scene: view updated.
 scene: "3" recalled.
PyMOL>cmd._dump_floats(cmd.get_view(0))
  1.000   0.000   0.000   0.000   0.996   0.087   0.000  -0.087   0.996
  0.000   0.000 -63.191   1.224 -10.279  20.545  49.820  76.561 -20.000
PyMOL>ray
 RayRenderTest: obtained 180 graphics primitives.
PyMOL>scene 4
 Scene: view updated.
 scene: "4" recalled.
PyMOL>cmd._dump_floats(cmd.get_view(0))
  0.996   0.000  -0.087   0.008   0.996   0.087   0.087  -0.087   0.992
  0.000   0.000 -63.191   1.224 -10.279  20.545  49.820  76.561 -20.000
PyMOL>ray
 RayRenderTest: obtained 172 graphics primitives.
PyMOL>scene 5
 Scene: view updated.
 scene: "5" recalled.
PyMOL>cmd._dump_floats(cmd.get_view(0))
  0.940   0.342   0.000  -0.341   0.936   0.087   0.030  -0.082   0.996
  0.000   0.000 -63.191   1.224 -10.279  20.545  49.820  76.561 -20.000
PyMOL>ray
 RayRenderTest: obtained 166 graphics primitives.
PyMOL>scene 0
Error: unknown scene: '0'. Choices:
  1  2  3  4  5
PyMOL>scene 6
Error: unknown scene: '6'. Choices:
  1  2  3  4  5
PyMOL>scene 1000
Error: unknown scene: '1000'. Choices:
  1  2  3  4  5
PyMOL>scene 4,clear
 scene: '4' deleted.
PyMOL>scene 4
Error: unknown scene: '4'. Choices:
  1  2  3  5
PyMOL>scene *
 scene: current order:
  1  2  3  5
PyMOL>scene *,clear
PyMOL>scene *
 scene: current order:
PyMOL>scene 1
Error: unknown scene: '1'. Choices:
PyMOL>hide
PyMOL>show lines
PyMOL>color red
 Executive: Colored 107 atoms.
PyMOL>scene 1, store
 scene: scene stored as "1".
PyMOL>count_atoms color red
 count_atoms: 107 atoms
PyMOL>count_atoms color blue
 count_atoms: 0 atoms
PyMOL>ray
 RayRenderTest: obtained 112 graphics primitives.
PyMOL>hide
PyMOL>show sticks
PyMOL>color blue
 Executive: Colored 107 atoms.
PyMOL>scene 2, store
 scene: scene stored as "2".
PyMOL>count_atoms color red
 count_atoms: 0 atoms
PyMOL>count_atoms color blue
 count_atoms: 107 atoms
PyMOL>ray
 RayRenderTest: obtained 112 graphics primitives.
PyMOL>scene 1
 Scene: view updated.
 scene: "1" recalled.
PyMOL>count_atoms color red
 count_atoms: 107 atoms
PyMOL>count_atoms color blue
 count_atoms: 0 atoms
PyMOL>ray
 RayRenderTest: obtained 112 graphics primitives.
PyMOL>scene 2
 Scene: view updated.
 scene: "2" recalled.
PyMOL>count_atoms color red
 count_atoms: 0 atoms
PyMOL>count_atoms color blue
 count_atoms: 107 atoms
PyMOL>ray
 RayRenderTest: obtained 112 graphics primitives.
PyMOL>scene 2,rename,new_key=3
 scene: '2' renamed to '3'.
PyMOL>scene 1
 Scene: view updated.
 scene: "1" recalled.
PyMOL>count_atoms rep lines
 count_atoms: 107 atoms
PyMOL>count_atoms color red
 count_atoms: 107 atoms
PyMOL>count_atoms rep sticks
 count_atoms: 0 atoms
PyMOL>count_atoms color blue
 count_atoms: 0 atoms
PyMOL>ray
 RayRenderTest: obtained 112 graphics primitives.
PyMOL>scene 3
 Scene: view updated.
 scene: "3" recalled.
PyMOL>count_atoms rep lines
 count_atoms: 0 atoms
PyMOL>count_atoms color red
 count_atoms: 0 atoms
PyMOL>count_atoms rep sticks
 count_atoms: 107 atoms
PyMOL>count_atoms color blue
 count_atoms: 107 atoms
PyMOL>ray
 RayRenderTest: obtained 112 graphics primitives.
PyMOL>scene 2
Error: unknown scene: '2'. Choices:
  1  3
PyMOL>count_atoms rep lines
 count_atoms: 0 atoms
PyMOL>count_atoms color red
 count_atoms: 0 atoms
PyMOL>count_atoms rep sticks
 count_atoms: 107 atoms
PyMOL>count_atoms color blue
 count_atoms: 107 atoms
PyMOL>ray
 RayRenderTest: obtained 112 graphics primitives.
PyMOL>scene 3
 Scene: view updated.
 scene: "3" recalled.
PyMOL>hide
PyMOL>color green
 Executive: Colored 107 atoms.
PyMOL>show spheres
PyMOL>scene auto, update
 scene: scene updated as "3".
PyMOL>count_atoms rep spheres
 count_atoms: 107 atoms
PyMOL>count_atoms color green
 count_atoms: 107 atoms
PyMOL>count_atoms rep lines
 count_atoms: 0 atoms
PyMOL>count_atoms color red
 count_atoms: 0 atoms
PyMOL>count_atoms rep sticks
 count_atoms: 0 atoms
PyMOL>count_atoms color blue
 count_atoms: 0 atoms
PyMOL>scene 1
 Scene: view updated.
 scene: "1" recalled.
PyMOL>count_atoms rep spheres
 count_atoms: 0 atoms
PyMOL>count_atoms color green
 count_atoms: 0 atoms
PyMOL>count_atoms rep lines
 count_atoms: 107 atoms
PyMOL>count_atoms color red
 count_atoms: 107 atoms
PyMOL>count_atoms rep sticks
 count_atoms: 0 atoms
PyMOL>count_atoms color blue
 count_atoms: 0 atoms
PyMOL>scene 3
 Scene: view updated.
 scene: "3" recalled.
PyMOL>count_atoms rep spheres
 count_atoms: 107 atoms
PyMOL>count_atoms color green
 count_atoms: 107 atoms
PyMOL>count_atoms rep lines
 count_atoms: 0 atoms
PyMOL>count_atoms color red
 count_atoms: 0 atoms
PyMOL>count_atoms rep sticks
 count_atoms: 0 atoms
PyMOL>count_atoms color blue
 count_atoms: 0 atoms
